package com.cat.server.game.module.family.assist;

public class FamilyConstant {
	
	/**
	 * 加入家族间隔时间, 如果是被踢则可以继续加入
	 */
	public static long JOIN_TIME_LIMIT = 24 * 3600 * 1000;
	
	
	
	/*
	 * 权限状态用于服务器计算
	 * 权限类1
	 * 1-职责分配 
	 * 2-解散
	 * 3-禅让
	 * 4-改家族号
	 * 5-改家族名,公告
	 * 6-外交
	 * 7-自定义职位
	 * 
	 *权限类2
	 * 11-审批
	 * 12-踢人
	 * 13-邀请-直接通过
	 * 14-升级家族, 升级祭坛
	 * 15-研制商店商品,家族技能
	 * 16-开启家族副本,家族战,家族竞赛. 
	 * 17-开启家族战
	 * 18-家族邮件
	 * 
	 *权限类3, 
	 * 100-推翻族长
	 * 副族长申请,满足10人即可, 长老申请满足15人即可,普通成员满足20人即可
	 * 1.族长拥有一票否决权
	 * 2.所有长老,副族长全部同意, 可以否掉族长一票否决权.
	 * 101-代邀请,绕过家族限制进入申请列表
	 * 
	 *权限分配 
	 * -	族长固定权限.1.职责分配,2.解散,3禅让,4-改家族号,5-改家族名,公告,6-外交,7.自定义职位
	 * -	副族长固定权限. 1.职责分配,5-改家族名,公告.6-外交
	 * 长老权限.7-审批,8-踢人,9-邀请,10-升级家族, 升级祭坛,11-研制商店商品,家族技能,12-开启家族副本,家族战,家族竞赛. 
	 * 13-开启家族战, 14-家族邮件
	 * -	自定义权限-权限类2,由族长控制生成
	 * -	普通成员 100,101
	 */
	/**	改名 */
	public static final int STATE_NONE 			= 0x00000000;
	/**	改公告*/
	public static final int STATE_NORMAL 			= 0x00000001;
	/**	审批*/
	public static final int STATE_NORMAL_REWARD 	= 0x00000002;
	/**	充值激活*/
	public static final int STATE_CHARGE 			= 0x00000004;
	/**	充值领取*/
	public static final int STATE_CHARGE_REWARD 	= 0x00000008;

}
